Конфигурация/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ДоходыРасходы/ДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипСтатьи</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // Считаем общую сумму зарплаты
    ИтогоЗарплата = 0;
    Для Каждого Строка Из Сотрудники Цикл
        ИтогоЗарплата = ИтогоЗарплата + Строка.Сумма;
    КонецЦикла;
    
    // Записываем в регистр доходов/расходов
    Движение = Движения.ДоходыРасходы.Добавить();
    Движение.Период = Дата;
    Движение.ТипСтатьи = Справочники.Статьи.РасходыНаОплатуТруда;
    Движение.Сумма = ИтогоЗарплата;
    
    Движения.ДоходыРасходы.Записывать = Истина;
    
КонецПроцедуры
